# StructuralUsage Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralInstanceUsageFilter..::..StructuralUsage Property
StructuralInstanceUsageFilter Class See Also
---
The family instance structural usage.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public StructuralInstanceUsage StructuralUsage { get; }
```

Visual Basic
---
```text
Public ReadOnly Property StructuralUsage As StructuralInstanceUsage
	Get
```

Visual C++
---
```text
public:
property StructuralInstanceUsage StructuralUsage {
	StructuralInstanceUsage get ();
}
```

# See Also
StructuralInstanceUsageFilter Class
Autodesk.Revit.DB.Structure Namespace